# Introduction to pandas

In [2]:
import pandas as pd
import numpy as np

Importing a csv file is simple using pandas. See the code below.

In [6]:
# downloaded dataset from Housing Prices Competition in Kaggle
# https://www.kaggle.com/competitions/home-data-for-ml-course
data = pd.read_csv("../Datasets/HousingPrices/train.csv")

In [5]:
data.head()

,Id,MSSubClass,MSZoning,LotFrontage,LotArea,Street,Alley,LotShape,LandContour,Utilities,...,PoolArea,PoolQC,Fence,MiscFeature,MiscVal,MoSold,YrSold,SaleType,SaleCondition,SalePrice
0,1,60,RL,65.0,8450,Pave,NaN,Reg,Lvl,AllPub,...,0,NaN,NaN,NaN,0,2,2008,WD,Normal,208500
1,2,20,RL,80.0,9600,Pave,NaN,Reg,Lvl,AllPub,...,0,NaN,NaN,NaN,0,5,2007,WD,Normal,181500
2,3,60,RL,68.0,11250,Pave,NaN,IR1,Lvl,AllPub,...,0,NaN,NaN,NaN,0,9,2008,WD,Normal,223500
3,4,70,RL,60.0,9550,Pave,NaN,IR1,Lvl,AllPub,...,0,NaN,NaN,NaN,0,2,2006,WD,Abnorml,140000
4,5,60,RL,84.0,14260,Pave,NaN,IR1,Lvl,AllPub,...,0,NaN,NaN,NaN,0,12,2008,WD,Normal,250000

It works!\
However, the data below will be used

### DataFrames

In [13]:
# from ML Zoomcamp 1.9
data = [
    ['Nissan', 'Stanza', 1991, 138, 4, 'MANUAL', 'sedan', 2000],
    ['Hyundai', 'Sonata', 2017, None, 4, 'AUTOMATIC', 'Sedan', 27150],
    ['Lotus', 'Elise', 2010, 218, 4, 'MANUAL', 'convertible', 54990],
    ['GMC', 'Acadia',  2017, 194, 4, 'AUTOMATIC', '4dr SUV', 34450],
    ['Nissan', 'Frontier', 2017, 261, 6, 'MANUAL', 'Pickup', 32340],
]
 
columns = [
    'Make', 'Model', 'Year', 'Engine HP', 'Engine Cylinders',
    'Transmission Type', 'Vehicle_Style', 'MSRP'
]
 
df = pd.DataFrame(data, columns=columns)

As you can see, I've passed in the ***.DataFrame()*** two parameters namely: data and columns.\
pandas uses the data as the content and the column list as the name of each column.

Note: We can also create lists using dictionaries instead of arrays like the code snippet above. With dictionaries, there's no need to provide a list of columns. Instead, pandas uses the Key as the column.

In [14]:
df.head(n=2)

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150

### Series

Every column of a DataFrame is a series. Thus, we can say that a table consists of multiple series.

In pandas, we can access a series by referring to it using the ***dot*** operator similar to objects in most programming languages.\
Refer to the code below.

In [16]:
df.Make # the same as df['Make']

0     Nissan
1    Hyundai
2      Lotus
3        GMC
4     Nissan
Name: Make, dtype: object

***df.Make*** allowed me to access the values under the *Make* column of the DataFrame.

I prefer to use the indexing method because it is much reliable.\
By indexing, I meant the code below:

In [17]:
df['Make']

0     Nissan
1    Hyundai
2      Lotus
3        GMC
4     Nissan
Name: Make, dtype: object

The good thing with this way of accessing values is that we can actually pass more than one indices

In [18]:
df[['Make', 'Model']]

      Make     Model
0   Nissan    Stanza
1  Hyundai    Sonata
2    Lotus     Elise
3      GMC    Acadia
4   Nissan  Frontier

Naturally, we can store the column names in a list and pass it as an index to the DataFrame object.

In [19]:
# in ML, the column names in a set of data are referred to as "Features"
features = ['Make', 'Model']
df[features]

      Make     Model
0   Nissan    Stanza
1  Hyundai    Sonata
2    Lotus     Elise
3      GMC    Acadia
4   Nissan  Frontier

It is also possible to add another column to our DataFrame.

In [22]:
df['id'] = [1, 2, 3, 4, 5] # df['[column name]'] = [values]

In [23]:
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,id
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,1
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,2
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,3
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,4
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,5

Deleting is also doable with the ***del*** keyword

In [24]:
del df['id']

In [25]:
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

### Index

We can access the elements of the DataFrame by index.

In [26]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [27]:
df.Make.index

RangeIndex(start=0, stop=5, step=1)

There's a lot of stuff we can do with indexing in DataFrames.\
For one, we can use ***.loc[]*** that locates the values of the index we specified.

In [28]:
df.loc[1]

Make                   Hyundai
Model                   Sonata
Year                      2017
Engine HP                  NaN
Engine Cylinders             4
Transmission Type    AUTOMATIC
Vehicle_Style            Sedan
MSRP                     27150
Name: 1, dtype: object

Getting multiple rows is also possible by passing an array of indices just like I did with the *features*

In [29]:
indices = [1, 2, 3]
df.loc[indices]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450

Modifying the indices is possible by simply assigning new values to it.

In [31]:
df.index = ['a', 'b', 'c', 'd', 'e']
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
a,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
b,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
c,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
d,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
e,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

In [50]:
# revert indices because I want numbers instead
# we can set drop=True to drop the previous indexing we replaced with reset. 
# If not set to true, pandas will add another column
df = df.reset_index(drop=True)

But wait! We can still actually refer to the elements with numbers using ***.iloc[]*** instead of ***.loc[]***

In [51]:
df.iloc[0]

Make                 Nissan
Model                Stanza
Year                   1991
Engine HP             138.0
Engine Cylinders          4
Transmission Type    MANUAL
Vehicle_Style         sedan
MSRP                   2000
Name: 0, dtype: object

### Element-wise operations

Similar to numpy, we can also perform operations on the values of the columns(series) by simply treating them like another number.

In [52]:
df.MSRP + 1

0     2001
1    27151
2    54991
3    34451
4    32341
Name: MSRP, dtype: int64

In [53]:
df.MSRP - 1

0     1999
1    27149
2    54989
3    34449
4    32339
Name: MSRP, dtype: int64

In [54]:
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

We can also make use of comparison operators like the code below:

In [55]:
# This returns a set of boolean values
df['Year'] >= 2010

0    False
1     True
2     True
3     True
4     True
Name: Year, dtype: bool

### Filtering

We can apply the element-wise operations mentioned above to filter want we want to see from the DataFrame.

In [56]:
df[df['Year'] >= 2010]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

In [60]:
# this subtracts 5000 from the MSRP
# and finds the row with value greater than or equal to 30000
# after the operation
df[df['MSRP'] - 5000 >= 30000]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990

Multiple filters can be applied to the DataFrame by using some of the bitwise operators(&, |)

In [65]:
df[
    (df['Year'] >= 2010) | (df['MSRP'] <= 33500)
]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

In [66]:
df[
    (df['Year'] >= 2010) & (df['MSRP'] <= 33500)
]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340



### String Operations

We can perform string manipulation to the values of the DataFrame.\
For example, we can set the string of a series to lowercase or uppercase.

In [73]:
# similar to other operations we've made,
# this doesn't change(overwrite) the actual value of our DataFrame variable df
# we can do that by setting df['Model'] = df['Model'].str.upper()
df['Model'].str.upper()

0      STANZA
1      SONATA
2       ELISE
3      ACADIA
4    FRONTIER
Name: Model, dtype: object

We can use other python string functions such as ***.replace***

In [74]:
df['Vehicle_Style'].str.replace(' ', '_')

0          sedan
1          Sedan
2    convertible
3        4dr_SUV
4         Pickup
Name: Vehicle_Style, dtype: object

### Summarizing operations

We can use some of the useful summarizing operations such as ***min*** and ***max***.

In [76]:
print(df['MSRP'].max())
print(df['MSRP'].min())

54990
2000

There is also a useful function ***.describe()*** that displays useful information.

In [80]:
df['MSRP'].describe()

count        5.000000
mean     30186.000000
std      18985.044904
min       2000.000000
25%      27150.000000
50%      32340.000000
75%      34450.000000
max      54990.000000
Name: MSRP, dtype: float64

The function ***.describe*** only works for numerical columns.\
We can use it on the entire DataFrame and it will return a new detailed table for the numerical values in the original DataFrame.

In [82]:
df.describe()
# to make it more compact, use the round() function
# the line below rounds the numbers to 2 decimal places
# df.describe().round(2)

              Year  Engine HP  Engine Cylinders          MSRP
count     5.000000    4.00000          5.000000      5.000000
mean   2010.400000  202.75000          4.400000  30186.000000
std      11.260551   51.29896          0.894427  18985.044904
min    1991.000000  138.00000          4.000000   2000.000000
25%    2010.000000  180.00000          4.000000  27150.000000
50%    2017.000000  206.00000          4.000000  32340.000000
75%    2017.000000  228.75000          4.000000  34450.000000
max    2017.000000  261.00000          6.000000  54990.000000

To find the number of unique values, use ***.nunique()***.

In [86]:
df.nunique()

Make                 4
Model                5
Year                 3
Engine HP            4
Engine Cylinders     2
Transmission Type    2
Vehicle_Style        5
MSRP                 5
dtype: int64

### Dealing with Missing Values

There is a function called ***.isnull()*** that returns the DataFrame with its values replaced by True or False.\
The value depends whether the value in that column is null or not

In [88]:
df.isnull()

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,False,False,False,False,False,False,False,False
1,False,False,False,True,False,False,False,False
2,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False

This alone is not really that helpful especially when we start to deal with larger datasets.\
To utilize it well, we can use other functions to make use of the result.

In [89]:
# finds the sum of null values for each column
df.isnull().sum()

Make                 0
Model                0
Year                 0
Engine HP            1
Engine Cylinders     0
Transmission Type    0
Vehicle_Style        0
MSRP                 0
dtype: int64

### Grouping

Consider the following block of code with SQL:
```
SELECT
    transmission_type,
    AVG(MSRP)
FROM
    cars
GROUP BY
    transmission_type
```

How do we do this with pandas?

In [90]:
# group columns
df.groupby('Transmission Type').MSRP.mean()

Transmission Type
AUTOMATIC    30800.000000
MANUAL       29776.666667
Name: MSRP, dtype: float64

### Getting the NumPy arrays

The table in pandas is actually made out of NumPy arrays. With that said, we can access the values as a NumPy array with the ***.values***

In [91]:
df.MSRP.values

array([ 2000, 27150, 54990, 34450, 32340], dtype=int64)

In [92]:
df.values

array([['Nissan', 'Stanza', 1991, 138.0, 4, 'MANUAL', 'sedan', 2000],
       ['Hyundai', 'Sonata', 2017, nan, 4, 'AUTOMATIC', 'Sedan', 27150],
       ['Lotus', 'Elise', 2010, 218.0, 4, 'MANUAL', 'convertible', 54990],
       ['GMC', 'Acadia', 2017, 194.0, 4, 'AUTOMATIC', '4dr SUV', 34450],
       ['Nissan', 'Frontier', 2017, 261.0, 6, 'MANUAL', 'Pickup', 32340]],
      dtype=object)

### Extras

We can actually convert a DataFrame to another type of object like the one below.

In [94]:
# convert dataframe to a dictionary
# change the orientation to records for better readability
df.to_dict(orient="records")

[{'Make': 'Nissan',
  'Model': 'Stanza',
  'Year': 1991,
  'Engine HP': 138.0,
  'Engine Cylinders': 4,
  'Transmission Type': 'MANUAL',
  'Vehicle_Style': 'sedan',
  'MSRP': 2000},
 {'Make': 'Hyundai',
  'Model': 'Sonata',
  'Year': 2017,
  'Engine HP': nan,
  'Engine Cylinders': 4,
  'Transmission Type': 'AUTOMATIC',
  'Vehicle_Style': 'Sedan',
  'MSRP': 27150},
 {'Make': 'Lotus',
  'Model': 'Elise',
  'Year': 2010,
  'Engine HP': 218.0,
  'Engine Cylinders': 4,
  'Transmission Type': 'MANUAL',
  'Vehicle_Style': 'convertible',
  'MSRP': 54990},
 {'Make': 'GMC',
  'Model': 'Acadia',
  'Year': 2017,
  'Engine HP': 194.0,
  'Engine Cylinders': 4,
  'Transmission Type': 'AUTOMATIC',
  'Vehicle_Style': '4dr SUV',
  'MSRP': 34450},
 {'Make': 'Nissan',
  'Model': 'Frontier',
  'Year': 2017,
  'Engine HP': 261.0,
  'Engine Cylinders': 6,
  'Transmission Type': 'MANUAL',
  'Vehicle_Style': 'Pickup',
  'MSRP': 32340}]